Revit 2020 API
WallPaint Class
 Represents the properties of materials.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2018.1
Syntax
C#
public static class WallPaint
Visual Basic
Public NotInheritable Class WallPaint
Visual C++
public ref class WallPaint abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.WallPaint
See Also
WallPaint Members
Autodesk.Revit.DB.Visual Namespace